# -*- coding:utf-8 -*-

class Global:

    # 请求集合{'外部流水号': {easyLifeOrderNo:'', outBizNo: '', status:'', paymentType: '', userCode:'', paymentAmount:1.00}, '':{}}
    #GLOBAL_REQUEST = {}

    # 备付金
    #GLOBAL_BALANCE = 10000.00

    # 商户key
    GLOBAL_MERCHANTS = {'lencee': '9a7520152a7a97cfc76c82454463a83c'}

    # 缴费表
    GLOBAL_TABLE_PAYMENT = 'easylife_payment_order'
    # 预存款
    GLOBAL_TABLE_BALANCE = 'easylife_merchant_balance'

    # 结果码
    GLOBAL_RESP_CODE = {
        '0000000': u'执行成功',
        '0000100': u'参数不合法',
        '0000101': u'可用余额小于缴费金额',
        '0000102': u'当前机构不可用或当前用户无此机构使用权限',
        '0000103': u'订单创建失败',
        '0000104': u'担保交易创建失败',
        '0000105': u'缴费过程中校验失败',
        '0000106': u'缴费失败',
        '0000107': u'缴费处理中',
        '0000108': u'缴费部分失败',
        '0000109': u'缴费前的处理失败',
        '0000110': u'数据未找到',
        '0000111': u'外部订单号已存在',
        '0000120': u'缴费用户不存在',
        '0000121': u'没有欠费信息',
        '0000122': u'缴费用户账户状态不正常',
        '0000123': u'没有抄表或缴费账单未生成',
        '0000124': u'用户上月未交费',
        '0000125': u'卡或表故障',
        '0000126': u'超过限定金额',
        '0000127': u'撤销缴费出错',
        '0000128': u'路由失败',
        '0000129': u'支付金额不能小于欠费金额',
        '0000130': u'支付金额必须等于欠费金额',
        '0000131': u'不在缴费时间段',
        '0000132': u'业务前置条件不满足',
        '0000133': u'返销处理中',
        '0000134': u'业务状态异常',
        '0000201': u'缴费系统远端执行异常',
        '0000202': u'缴费系统参数异常',
        '0000204': u'缴费系统远端返回系统级异常',
        '0000205': u'缴费系统远端返回未知异常',
        '0000300': u'账户金额冻结失败',
        '0000302': u'退款失败',
        '0000303': u'分润退款失败',
        '0000400': u'未知异常',
        '0000401': u'数据库访问异常',
        '0000402': u'交易系统网络异常',
        '0000403': u'缴费系统网络异常',
    }

    def __init__(self):
        pass
